pencil/solectrac/embedded/esp32-s3/src/main.cpp
struct BmsLimits {
    float    discharge_a   = NAN;
    float    charge_a      = NAN;
    uint8_t  mode          = 0;
    uint8_t  byte5         = 0;
    bool     valid         = false;
    uint32_t last_seen_ms  = 0;
    // Wake-edge timestamp: set on the first F107F3 after a >2s silence
    // (or after firmware boot). Fires on every key cycle that takes the
    // BMS fully offline; used by the tractor-status "starting" detector.
    uint32_t wake_ms       = 0;
};

struct BmsFaults {
    uint8_t  bytes[8]          = {};
    uint64_t active_codes_mask = 0;  // bit (code-100) set if code active
    bool     any_fault         = false;
};

struct MotorState {
    int16_t  rpm_signed    = 0;
    uint16_t rpm_magnitude = 0;
    int8_t   direction     = 0;
    uint8_t  range    = 1;
    uint8_t  torque_raw  = 0;
    int8_t   controller_temp_c = INT8_MIN;
    int8_t   motor_temp_c      = INT8_MIN;
    bool     valid             = false;
    uint32_t last_seen_ms      = 0;
    // Wake-edge timestamp: set on the first FF21CA after a >0.5s silence.
    // Fires on every key cycle that drops the MC, even partial cycles
    // where the BMS stays awake. Not set on the very first frame.
    uint32_t wake_ms           = 0;
};

struct ChargerState {
    uint8_t  status   = 0;
    uint16_t v_raw    = 0;
    uint16_t i_raw    = 0;
    float    voltage_v = NAN;
    float    current_a = NAN;
    bool     valid    = false;
};

struct ChgrCmdState {
    float    voltage_v = NAN;
    float    current_a = NAN;
    uint8_t  enable    = 1;
    uint16_t v_raw     = 0;
    uint16_t i_raw     = 0;
    bool     valid     = false;
};

struct Dm1State {
    uint8_t  lamp_byte0 = 0, lamp_byte1 = 0;
    uint32_t dtc_spn    = 0;
    uint8_t  dtc_fmi    = 0, dtc_cm = 0, dtc_oc = 0;
    bool     valid      = false;
};

// ── Global state ──────────────────────────────────────────────────────────────
// All updated from the CAN decode path inside loop(), read when building JSON
// from the same thread — no locking needed.

float       g_cell_v[NUM_CELLS];
float       g_temp_c[NUM_TEMPS];
PackState   g_pack;
BmsStateFlags g_bms_state;
BmsLimits   g_bms_limit;
BmsFaults   g_bms_faults;
MotorState  g_motor;
ChargerState g_charger;
ChgrCmdState g_chgr_cmd;
uint8_t     g_vc_state   = 0xFF;   // 0xFF = never seen
uint8_t     g_dash_alive = 0xFF;
Dm1State    g_dm1;

// CAN bus health counters
uint32_t    g_frames_rx      = 0;   // total frames received
uint32_t    g_frames_decoded = 0;   // frames matching a known PGN/source
uint32_t    g_last_frame_ms  = 0;   // millis() at last received frame
bool        g_can_initialized = false;
bool        g_ap_running      = false;

// Session energy tracking (integrated power since boot)
uint32_t    g_session_last_ms   = 0;
uint32_t    g_session_active_ms = 0;   // sum of valid dt's — excludes bus-silent gaps
float       g_session_wh_drawn  = 0.0f;
float       g_session_wh_charged = 0.0f;

WebServer server(80);
DNSServer  dns_server;

// Dashboard HTML, embedded at build time via board_build.embed_txtfiles in
// platformio.ini. The linker generates these symbols from the file path:
// src/dashboard.html → _binary_src_dashboard_html_{start,end}. The data is
// null-terminated (embed_txtfiles), so the start pointer is usable as a
// C-string for server.send_P().
extern const uint8_t dashboard_html_start[] asm("_binary_src_dashboard_html_start");
extern const uint8_t dashboard_html_end[]   asm("_binary_src_dashboard_html_end");

// ── LED status indicator ──────────────────────────────────────────────────────
// On boards with a NeoPixel (Adafruit Feather S3 — GPIO 33, power gated by
// GPIO 21), status is colour-coded:
//   Red blink     — CAN driver failed to initialize
//   Amber blink   — No Wi-Fi up at all (AP failed and STA not connected)
//   Dim white     — Alive, no CAN frames received recently
//   Green blink   — CAN frames arriving (toggles on bus activity)
// On boards without a user LED (LilyGo T-2CAN), the calls are no-ops.

#define LED_BLINK_MS     50
#define LED_ACTIVE_MS    200

static uint32_t g_led_last_toggle = 0;
static bool     g_led_on = false;

static inline void ledInit() {
#if LED_IS_NEOPIXEL
    pinMode(LED_POWER_PIN, OUTPUT);
    digitalWrite(LED_POWER_PIN, HIGH);   // enable NeoPixel power rail
#endif
}

static inline void ledWrite(uint8_t r, uint8_t g, uint8_t b) {
#if LED_IS_NEOPIXEL
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    rgbLedWrite(LED_PIN, r, g, b);
  #else
    neopixelWrite(LED_PIN, r, g, b);
  #endif
#else
    (void)r; (void)g; (void)b;
#endif
}

void updateLed() {
    uint32_t now = millis();
    bool toggle = (now - g_led_last_toggle) >= LED_BLINK_MS;

    if (!g_can_initialized) {
        if (toggle) { g_led_last_toggle = now; g_led_on = !g_led_on; }
        ledWrite(g_led_on ? 32 : 0, 0, 0);
        return;
    }
    if (!g_ap_running && WiFi.status() != WL_CONNECTED) {
        if (toggle) { g_led_last_toggle = now; g_led_on = !g_led_on; }
        ledWrite(g_led_on ? 24 : 0, g_led_on ? 12 : 0, 0);
        return;
    }
    bool active = (g_frames_rx > 0) && (now - g_last_frame_ms < LED_ACTIVE_MS);
    if (!active) {
        ledWrite(4, 4, 4);
        g_led_on = false;
        g_led_last_toggle = now;
        return;
    }
    if (toggle) {
        g_led_last_toggle = now;
        g_led_on = !g_led_on;
    }
    ledWrite(0, g_led_on ? 32 : 0, 0);
}

// ── Helpers ───────────────────────────────────────────────────────────────────

static inline uint16_t be16(uint8_t hi, uint8_t lo) {
    return ((uint16_t)hi << 8) | lo;
}

static inline uint16_t le16(uint8_t lo, uint8_t hi) {
    return ((uint16_t)hi << 8) | lo;
}

static bool allZero(const uint8_t* d) {
    for (int i = 0; i < 8; i++) if (d[i]) return false;
    return true;
}

// ── CAN decoder ───────────────────────────────────────────────────────────────

void decodeCAN(uint32_t can_id, const uint8_t* raw, uint8_t len) {
    g_frames_rx++;
    g_last_frame_ms = millis();

    uint8_t d[8] = {};
    memcpy(d, raw, len < 8 ? len : 8);

    uint8_t  src = can_id & 0xFF;
    uint8_t  pf  = (can_id >> 16) & 0xFF;
    uint8_t  ps  = (can_id >> 8)  & 0xFF;
    uint16_t pgn = ((uint16_t)pf << 8) | (pf >= 0xF0 ? ps : 0);

    // Count any frame from a known source as decoded, before the per-PGN
    // decoders below — they often early-return on all-zero idle frames.
    if (src == SRC_BMS || src == SRC_BMS_CHGR_IF || src == SRC_CHARGER ||
        src == SRC_VEHICLE || src == SRC_MOTOR || src == SRC_DASH)
        g_frames_decoded++;

