pencil/solectrac/embedded/esp32-s3/src/main.cpp
void slcanHandleCommand(const char* cmd) {
    switch (cmd[0]) {
        case 'O': slcan_open = true;  Serial.write('\r'); break;
        case 'C': slcan_open = false; Serial.write('\r'); break;
        case 'S': Serial.write('\r'); break;   // speed — fixed at 250k
        case 'V': Serial.print("V1013\r"); break;
        case 'N': Serial.print("NA000\r"); break;
        case 'F': Serial.print("F00\r");   break;
        default:  Serial.write('\r'); break;
    }
}

void slcanPoll() {
    while (Serial.available()) {
        char c = Serial.read();
        if (c == '\r' || c == '\n') {
            if (slcan_len > 0) {
                slcan_buf[slcan_len] = '\0';
                slcanHandleCommand(slcan_buf);
                slcan_len = 0;
            }
        } else if (slcan_len < sizeof(slcan_buf) - 1) {
            slcan_buf[slcan_len++] = c;
        }
    }
}

// ── socketcand ────────────────────────────────────────────────────────────────
// Streams raw CAN frames over WiFi using the socketcand ASCII protocol.
// python-can: interface='socketcand', host='tractor.local', port=28600,
//             channel='can0'  (channel name is accepted but ignored).
//
// Single client at a time: a new connection drops the previous one. All work
// is skipped when no client is in rawmode, so the cost when idle is one
// pointer check per CAN frame.

#define SOCKETCAND_PORT 28600

enum SocketcandState {
    SC_DISCONNECTED,
    SC_WAITING_OPEN,
    SC_WAITING_RAWMODE,
    SC_RAWMODE,
};

static WiFiServer socketcand_server(SOCKETCAND_PORT);
static WiFiClient socketcand_client;
static SocketcandState socketcand_state = SC_DISCONNECTED;
static char     socketcand_buf[64];
static uint8_t  socketcand_len = 0;

void socketcandSendFrame(const twai_message_t& msg) {
    if (socketcand_state != SC_RAWMODE) return;
    uint32_t now_ms = millis();
    uint32_t secs   = now_ms / 1000;
    uint32_t usecs  = (now_ms % 1000) * 1000;
    // EFF flag (bit 31) marks the ID as 29-bit extended — python-can expects this.
    uint32_t id_wire = msg.identifier | (msg.extd ? 0x80000000UL : 0);
    char line[80];
    int n = snprintf(line, sizeof(line), "< frame %lX %lu.%06lu ",
                     (unsigned long)id_wire,
                     (unsigned long)secs, (unsigned long)usecs);
    for (int i = 0; i < msg.data_length_code && n < (int)sizeof(line) - 4; i++)
        n += snprintf(line + n, sizeof(line) - n, "%02X", msg.data[i]);
    n += snprintf(line + n, sizeof(line) - n, " >");
    socketcand_client.write((const uint8_t*)line, n);
}

static void socketcandHandleCommand(const char* cmd) {
    if (socketcand_state == SC_WAITING_OPEN && strncmp(cmd, "< open ", 7) == 0) {
        socketcand_client.print("< ok >");
        socketcand_state = SC_WAITING_RAWMODE;
    } else if (socketcand_state == SC_WAITING_RAWMODE && strcmp(cmd, "< rawmode >") == 0) {
        socketcand_client.print("< ok >");
        socketcand_state = SC_RAWMODE;
    }
    // bcmmode/isotpmode/echo/statistics are intentionally unsupported.
}

void socketcandPoll() {
    WiFiClient new_client = socketcand_server.available();
    if (new_client) {
        if (socketcand_client) socketcand_client.stop();
        socketcand_client = new_client;
        socketcand_client.setNoDelay(true);
        socketcand_client.print("< hi >");
        socketcand_state = SC_WAITING_OPEN;
        socketcand_len   = 0;
    }
    if (socketcand_state != SC_DISCONNECTED && !socketcand_client.connected()) {
        socketcand_client.stop();
        socketcand_state = SC_DISCONNECTED;
        socketcand_len   = 0;
    }
    while (socketcand_client && socketcand_client.available()) {
        char c = socketcand_client.read();
        if (c == '<') {
            socketcand_len = 0;
            socketcand_buf[socketcand_len++] = c;
        } else if (socketcand_len > 0 && socketcand_len < sizeof(socketcand_buf) - 1) {
            socketcand_buf[socketcand_len++] = c;
            if (c == '>') {
                socketcand_buf[socketcand_len] = '\0';
                socketcandHandleCommand(socketcand_buf);
                socketcand_len = 0;
            }
        }
    }
}

// ── BLE (Nordic UART Service) ─────────────────────────────────────────────────
// Pushes a compact (minimal) JSON snapshot to a single BLE central whenever it
// differs from what we last sent. Framing on the wire is:
//
//     [u16 big-endian length] [length bytes of JSON]
//
// sent across N notifications of up to BLE_CHUNK_BYTES each. The Android
// client reassembles by counting bytes against the length prefix. Connection
// is unpaired — anyone in range with the NUS UUID can subscribe.
//
// MTU: we request 517 server-side; the actual MTU is whatever the client
// negotiates. BLE_CHUNK_BYTES is conservative so a default-MTU client (23)
// would still receive valid (if smaller) packets — but the Android app calls
// requestMtu(517) on connect.
//
// RX characteristic is exposed for future command/control (e.g. reset session
// counters); currently writes are accepted and ignored.

#define NUS_SVC_UUID  "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"
#define NUS_TX_UUID   "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"
#define NUS_RX_UUID   "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"

#define BLE_CHUNK_BYTES        180
#define BLE_PUSH_INTERVAL_MS   200    // diff cadence — actual send only on change
#define BLE_INTER_CHUNK_DELAY  5

static BLEServer*         g_ble_server = nullptr;
static BLECharacteristic* g_ble_tx     = nullptr;
static volatile bool      g_ble_connected = false;
static String             g_ble_last_payload;
static uint32_t           g_ble_last_push_ms = 0;

class BleServerCb : public BLEServerCallbacks {
    void onConnect(BLEServer*) override {
        g_ble_connected   = true;
        g_ble_last_payload = "";   // force a full resend on (re)connect
    }
    void onDisconnect(BLEServer* s) override {
        g_ble_connected   = false;
        g_ble_last_payload = "";
        s->getAdvertising()->start();   // resume advertising for the next client
    }
};

