pencil/solectrac/embedded/esp32-s3/src/main.cpp
void bleInit() {
    BLEDevice::init("tractor");
    BLEDevice::setMTU(517);

    g_ble_server = BLEDevice::createServer();
    g_ble_server->setCallbacks(new BleServerCb());

    BLEService* svc = g_ble_server->createService(NUS_SVC_UUID);
    g_ble_tx = svc->createCharacteristic(NUS_TX_UUID, BLECharacteristic::PROPERTY_NOTIFY);
    g_ble_tx->addDescriptor(new BLE2902());
    svc->createCharacteristic(NUS_RX_UUID,
        BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_WRITE_NR);
    svc->start();

    BLEAdvertising* adv = BLEDevice::getAdvertising();
    adv->addServiceUUID(NUS_SVC_UUID);
    adv->setScanResponse(true);
    BLEDevice::startAdvertising();
}

static void bleSendFramed(const String& payload) {
    if (!g_ble_connected || !g_ble_tx) return;
    size_t total = payload.length();
    if (total > 65535) return;

    // 8 KB scratch is plenty: minimal JSON for this dashboard runs ~600 B.
    static uint8_t buf[2 + 8192];
    size_t framed = 2 + total;
    if (framed > sizeof(buf)) return;
    buf[0] = (uint8_t)((total >> 8) & 0xFF);
    buf[1] = (uint8_t)(total & 0xFF);
    memcpy(buf + 2, payload.c_str(), total);

    size_t off = 0;
    while (off < framed) {
        size_t n = framed - off;
        if (n > BLE_CHUNK_BYTES) n = BLE_CHUNK_BYTES;
        g_ble_tx->setValue(buf + off, n);
        g_ble_tx->notify();
        off += n;
        if (off < framed) delay(BLE_INTER_CHUNK_DELAY);
    }
}

void bleTick() {
    if (!g_ble_connected) return;
    uint32_t now = millis();
    if (now - g_ble_last_push_ms < BLE_PUSH_INTERVAL_MS) return;
    g_ble_last_push_ms = now;

    String j = buildJson(false /*pretty*/, true /*minimal*/);
    if (j != g_ble_last_payload) {
        bleSendFramed(j);
        g_ble_last_payload = j;
    }
}

// ── Setup & loop ──────────────────────────────────────────────────────────────

void setup() {
    Serial.begin(115200);

    ledInit();
    ledWrite(4, 4, 4);   // dim white the moment firmware starts running

    for (int i = 0; i < NUM_CELLS; i++) g_cell_v[i] = NAN;
    for (int i = 0; i < NUM_TEMPS; i++) g_temp_c[i] = NAN;

    // CAN at 250 kbit/s (J1939 standard). Default rx_queue_len is 5, which
    // overflows when server.handleClient() blocks the loop building JSON.
    // 128 gives ~0.5 s of buffer at full bus utilisation.
    twai_general_config_t can_cfg = TWAI_GENERAL_CONFIG_DEFAULT(
        CAN_TX_PIN, CAN_RX_PIN, TWAI_MODE_NORMAL);
    can_cfg.rx_queue_len = 128;
    can_cfg.tx_queue_len = 32;
    twai_timing_config_t  tim_cfg = TWAI_TIMING_CONFIG_250KBITS();
    twai_filter_config_t  flt_cfg = TWAI_FILTER_CONFIG_ACCEPT_ALL();
    esp_err_t err = twai_driver_install(&can_cfg, &tim_cfg, &flt_cfg);
    if (err == ESP_OK) {
        err = twai_start();
        if (err == ESP_OK) g_can_initialized = true;
    }

    // Bring up the soft-AP first so the board is always reachable in the field
    // at 192.168.4.1 even if there's no home network in range. STA connect
    // happens in the background; we don't block boot waiting on it.
    WiFi.mode(WIFI_AP_STA);
    g_ap_running = WiFi.softAP(AP_SSID, AP_PASS);
    WiFi.begin(WIFI_SSID, WIFI_PASS);

    // Wildcard DNS on the soft-AP: any hostname (tractor.local, tractor,
    // captive-portal probes, etc.) resolves to the board's AP IP. Needed
    // because phones generally don't do mDNS over an AP with no internet.
    if (g_ap_running) dns_server.start(53, "*", WiFi.softAPIP());

    MDNS.begin("tractor");

    server.on("/",     handleRoot);
    server.on("/json", handleJson);
    server.begin();
    MDNS.addService("http", "tcp", 80);

    socketcand_server.begin();
    socketcand_server.setNoDelay(true);
    MDNS.addService("socketcand", "tcp", SOCKETCAND_PORT);

    bleInit();
}

void loop() {
    twai_message_t msg;
    while (twai_receive(&msg, 0) == ESP_OK) {
        if (msg.extd) {
            decodeCAN(msg.identifier, msg.data, msg.data_length_code);
            slcanSendFrame(msg);
            socketcandSendFrame(msg);
        }
    }
    slcanPoll();
    socketcandPoll();
    dns_server.processNextRequest();
    server.handleClient();
    bleTick();
    updateLed();
}
